
# The following macro allows insertion of newlines in titles, etc. It
# contains definitions for both latex and html from
# http://emacs.stackexchange.com/questions/255/new-line-in-title-of-an-org-mode-exported-html-document
#+MACRO: NEWLINE @@latex:\\@@ @@html:<br>@@

#+TITLE: Org-mode Latex Export {{{NEWLINE}}} Example

#+AUTHOR: Derek Feichtinger
#+EMAIL: derek.feichtinger@psi.ch
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:t todo:t |:t

# if the creator option is t, then use the string from CREATOR or the
# default if that is not set. The string is put at the end of the
# document.
#+OPTIONS: creator:t

#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

# By default I do not want that source code blocks are evaluated on export. Usually
# I want to evaluate them interactively and retain the original results. One can still
# override this on a per-source block level using the :eval header argument.
#+PROPERTY: header-args :eval never-export

* Version information
  - Emacs version
    #+BEGIN_SRC emacs-lisp :results output :exports results :eval query-export
    (princ (concat (format "Emacs version: %s\n" (emacs-version))
                   (format "org version: %s\n" (org-version))))
    
    #+END_SRC

    #+RESULTS:
    : Emacs version: GNU Emacs 25.3.1 (x86_64-pc-linux-gnu, GTK+ Version 3.18.9)
    :  of 2017-12-30
    : org version: 9.1.9

  - LaTeX version
    #+BEGIN_SRC bash :results output :exports results :eval query-export
    latex -v
    #+END_SRC

    #+RESULTS:
    #+begin_example
    pdfTeX 3.14159265-2.6-1.40.16 (TeX Live 2015/Debian)
    kpathsea version 6.2.1
    Copyright 2015 Peter Breitenlohner (eTeX)/Han The Thanh (pdfTeX).
    There is NO warranty.  Redistribution of this software is
    covered by the terms of both the pdfTeX copyright and
    the Lesser GNU General Public License.
    For more information about these matters, see the file
    named COPYING and the pdfTeX source.
    Primary author of pdfTeX: Peter Breitenlohner (eTeX)/Han The Thanh (pdfTeX).
    Compiled with libpng 1.6.17; using libpng 1.6.17
    Compiled with zlib 1.2.8; using zlib 1.2.8
    Compiled with poppler version 0.41.0
    #+end_example


*** nicer table formatting using booktab style

    Some [[http://www.inf.ethz.ch/personal/markusp/teaching/guides/guide-tables.pdf][interesting tips]] for \myindex{booktab style tables} by M. Püschel.
  
    Booktabs can be turned on by default for all tables by
    setting this variable for the document or globally:
    : org-latex-tables-booktabs: t

    Whether table captions appear above or below the table can be configured using this
    variable setting:
    : org-latex-table-caption-above: nil

    #+NAME: tblDefault
    #+CAPTION: default table
    #+ATTR_LATEX: :placement [H]
    | Column 1 | Column 2 | Column 3 | Column 4 |
    |----------+----------+----------+----------|
    |        1 |       10 |      100 |     1000 |
    |        2 |       11 |      101 |     1001 |
    |        3 |       12 |      102 |     1002 |
    |        4 |       13 |      103 |     1003 |
    |        5 |       14 |      104 |     1004 |
    |----------+----------+----------+----------|
    |       15 |       60 |      510 |     5010 |
    #+TBLFM: @>$1..@$4=vsum(@I..II)

    #+NAME: tblBooktabs
    #+CAPTION: table using booktabs style
    #+ATTR_LATEX: :placement [H] :booktabs t
    | Column 1 | Column 2 | Column 3 | Column 4 |
    |----------+----------+----------+----------|
    |        1 |       10 |      100 |     1000 |
    |        2 |       11 |      101 |     1001 |
    |        3 |       12 |      102 |     1002 |
    |        4 |       13 |      103 |     1003 |
    |        5 |       14 |      104 |     1004 |
    |----------+----------+----------+----------|
    |       15 |       60 |      510 |     5010 |
    #+TBLFM: @>$1..@$4=vsum(@I..II)

  
**** COMMENT location of the src table

    #+ORGTBL: SEND salesfigures orgtbl-to-latex :splice t :skip 2
    | Month | Days | Nr sold | per day |
    |-------+------+---------+---------|
    | Jan   |   23 |      55 |     2.4 |
    | Feb   |   21 |      16 |     0.8 |
    | March |   22 |     278 |    12.6 |
    #+TBLFM: $4=$3/$2;%.1f
   
